// @skip-check bsl-legacy-check-pragma-for-unused-method - Баг ЕДТ

#Область ОбработчикиСобытий

#Область ПриНачалеРаботыСистемы

&После("ПриНачалеРаботыСистемы")
Процедура РГП_ПриНачалеРаботыСистемы()
	
	РГП_ГлобальныйПоискКлиент.ПриНачалеРаботыСистемы();

КонецПроцедуры

&После("OnStart")
Процедура РГП_OnStart()
	
	РГП_ГлобальныйПоискКлиент.ПриНачалеРаботыСистемы();

КонецПроцедуры

#КонецОбласти

#Область ПриГлобальномПоиске

&После("ПриГлобальномПоиске")
Процедура РГП_ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
	
	РГП_ГлобальныйПоискКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
	
КонецПроцедуры

&После("OnGlobalSearch")
Процедура РГП_OnGlobalSearch(СтрокаПоиска, ПланПоиска)
	
	РГП_ГлобальныйПоискКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
	
КонецПроцедуры

#КонецОбласти

#Область ПриВыбореРезультатаГлобальногоПоиска

&После("ПриВыбореРезультатаГлобальногоПоиска")
Процедура РГП_ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка)
	
	РГП_ГлобальныйПоискКлиент.ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка);

КонецПроцедуры

&После("OnGlobalSearchResultChoice")
Процедура РГП_OnGlobalSearchResultChoice(ЭлементРезультата, СтандартнаяОбработка)
	
	РГП_ГлобальныйПоискКлиент.ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ПриВыбореДействияРезультатаГлобальногоПоиска

&После("ПриВыбореДействияРезультатаГлобальногоПоиска")
Процедура РГП_ПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие)
	
	РГП_ГлобальныйПоискКлиент.ПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие);

КонецПроцедуры

&После("OnGlobalSearchResultActionChoice")
Процедура РГП_OnGlobalSearchResultActionChoice(ЭлементРезультата, Действие)
	
	РГП_ГлобальныйПоискКлиент.ПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие);

КонецПроцедуры

#КонецОбласти

#Область ОбработкаПереходаПоНавигационнойСсылке

&После("ОбработкаПереходаПоНавигационнойСсылке")
Процедура РГП_ОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка)
	
	РГП_ГлобальныйПоискКлиент.ОбработкаПереходаПоНавигационнойСсылке(
		ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка);
	
КонецПроцедуры

&После("NavigationByURLProcessing")
Процедура РГП_NavigationByURLProcessing(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка)
	
	РГП_ГлобальныйПоискКлиент.ОбработкаПереходаПоНавигационнойСсылке(
		ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
