
#Область ОбработчикиСобытий

//@skip-check not-allowed-pragma - баг ЕДТ
&После("ПриНачалеРаботыСистемы")
Процедура РГП_ПриНачалеРаботыСистемы()
	
	РГП_ГлобальныйПоискКлиент.ПриНачалеРаботыСистемы();

КонецПроцедуры

//@skip-check not-allowed-pragma - баг ЕДТ
&После("ПриГлобальномПоиске")
Процедура РГП_ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
	
	РГП_ГлобальныйПоискКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
	
КонецПроцедуры

//@skip-check not-allowed-pragma - баг ЕДТ
&После("ПриВыбореРезультатаГлобальногоПоиска")
Процедура РГП_ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка)
	
	РГП_ГлобальныйПоискКлиент.ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти
