// @skip-check bsl-legacy-check-pragma-for-unused-method - Баг ЕДТ

#Область ОбработчикиСобытий

#Область ПриНачалеРаботыСистемы

&После("ПриНачалеРаботыСистемы")
Процедура РГП_ПриНачалеРаботыСистемы()
	
	РГП_СобытиеПриНачалеРаботыСистемы();

КонецПроцедуры

&После("OnStart")
Процедура РГП_OnStart()
	
	РГП_СобытиеПриНачалеРаботыСистемы();
	
КонецПроцедуры

#КонецОбласти

#Область ПриГлобальномПоиске

&После("ПриГлобальномПоиске")
Процедура РГП_ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
	
	РГП_СобытиеПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
	
КонецПроцедуры

&После("OnGlobalSearch")
Процедура РГП_OnGlobalSearch(СтрокаПоиска, ПланПоиска)
	
	РГП_СобытиеПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
	
КонецПроцедуры

#КонецОбласти

#Область ПриВыбореРезультатаГлобальногоПоиска

&После("ПриВыбореРезультатаГлобальногоПоиска")
Процедура РГП_ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка)
	
	РГП_СобытиеПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка);

КонецПроцедуры

&После("OnGlobalSearchResultChoice")
Процедура РГП_OnGlobalSearchResultChoice(ЭлементРезультата, СтандартнаяОбработка)
	
	РГП_СобытиеПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ПриВыбореДействияРезультатаГлобальногоПоиска

&После("ПриВыбореДействияРезультатаГлобальногоПоиска")
Процедура РГП_ПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие)
	
	РГП_СобытиеПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие);

КонецПроцедуры

&После("OnGlobalSearchResultActionChoice")
Процедура РГП_OnGlobalSearchResultActionChoice(ЭлементРезультата, Действие)
	
	РГП_СобытиеПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие);

КонецПроцедуры

#КонецОбласти

#Область ОбработкаПереходаПоНавигационнойСсылке

&После("ОбработкаПереходаПоНавигационнойСсылке")
Процедура РГП_ОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка)
	
	РГП_СобытиеОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка);
	
КонецПроцедуры

&После("NavigationByURLProcessing")
Процедура РГП_NavigationByURLProcessing(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка)
	
	РГП_СобытиеОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РГП_СобытиеПриНачалеРаботыСистемы()
	
	Попытка
		РГП_ГлобальныйПоискКлиент.ПриНачалеРаботыСистемы();
	Исключение
		РГП_ГлобальныйПоискКлиентСервер.ОбработатьОшибку(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

Процедура РГП_СобытиеПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
	
	Попытка
		РГП_ГлобальныйПоискКлиент.ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска);
	Исключение
		РГП_ГлобальныйПоискКлиентСервер.ОбработатьОшибку(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

Процедура РГП_СобытиеПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка)
	
	Попытка
		РГП_ГлобальныйПоискКлиент.ПриВыбореРезультатаГлобальногоПоиска(ЭлементРезультата, СтандартнаяОбработка);
	Исключение
		РГП_ГлобальныйПоискКлиентСервер.ОбработатьОшибку(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

Процедура РГП_СобытиеПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие)
	
	Попытка
		РГП_ГлобальныйПоискКлиент.ПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие);
	Исключение
		РГП_ГлобальныйПоискКлиентСервер.ОбработатьОшибку(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

Процедура РГП_СобытиеОбработкаПереходаПоНавигационнойСсылке(ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка)
	
	Попытка
		РГП_ГлобальныйПоискКлиент.ОбработкаПереходаПоНавигационнойСсылке(
			ДанныеПереходаПоНавигационнойСсылке, СтандартнаяОбработка);
	Исключение
		РГП_ГлобальныйПоискКлиентСервер.ОбработатьОшибку(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
