// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Переопределяемый модуль. 
// Метод позволяет подменить переопределяемый модуль, чтобы вести доработки в отдельном расширении
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция Модуль() Экспорт
	
	Возврат РГП_ГлобальныйПоискКлиентПереопределяемый;
	
КонецФункции

// см. РГП_ГлобальныйПоискКлиент.ПриГлобальномПоиске
Процедура ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска) Экспорт
	
	//Можно доработать
	
КонецПроцедуры

// см. РГП_ГлобальныйПоискКлиент.ПриНачалеРаботыСистемы
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	//Можно доработать
	
КонецПроцедуры

#КонецОбласти