// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Переопределяемый модуль. 
// Метод позволяет подменить переопределяемый модуль, чтобы вести доработки в отдельном расширении
// 
// Возвращаемое значение:РГП_ГлобальныйПоискКлиент
//  ОбщийМодуль
Функция Модуль() Экспорт
	
	Возврат РГП_ГлобальныйПоискКлиентПереопределяемый;
	
КонецФункции

// см. РГП_ГлобальныйПоискКлиент.ПриНачалеРаботыСистемы
Процедура ПослеСобытияПриНачалеРаботыСистемы() Экспорт
	
	//Можно доработать
	
КонецПроцедуры

// см. РГП_ГлобальныйПоискКлиент.ПриГлобальномПоиске
Процедура ПослеСобытияПриГлобальномПоиске(ИзначальнаяСтрокаПоиска, ПланПоиска) Экспорт
	
	//Можно доработать
	
КонецПроцедуры

// После заполнения параметров расширенного глобального поиска.
// 
// Параметры:
//  ПараметрыПоиска - см. РГП_ГлобальныйПоискКлиент.ПараметрыРасширенногоГлобальногоПоиска
Процедура ПослеЗаполненияПараметровРасширенногоГлобальногоПоиска(ПараметрыПоиска) Экспорт
	
	//Можно доработать параметры поиска и добавить свои команды
	//
	//
	//Отключение использования команды в зависимости от роли:
	//
	//		КомандаПоиска = РГП_ГлобальныйПоискКлиент.ОписаниеКомандыПоискаПоФормам(ПараметрыПоиска);
	//
	//		//Ограничение на полноправного пользователя (БСП)
	//		КомандаПоиска.Использование = РГП_ГлобальныйПоискКлиентСервер.ЭтоПолноправныйПользователь(ПараметрыПоиска);
	//
	//		//Ограничение по конкретной роли
	//		КомандаПоиска.Использование = РГП_ГлобальныйПоискКлиентСервер.РолиДоступны(ПараметрыПоиска, "АдминистраторСистемы");
	//
	//		//Ограничение по конкретному праву
	//		КомандаПоиска.Использование = РГП_ГлобальныйПоискКлиентСервер.ЕстьПравоДоступа(ПараметрыПоиска, "Администрирование");

КонецПроцедуры

// см. РГП_ГлобальныйПоискКлиент.ОбработчикСтандартнойКомандыПоиска_ВывестиКоманды
Процедура ПослеВыводаПодчиненныхКомандГлобальногоПоиска(СтрокаПоиска, РезультатыПоиска, ПараметрыВыполнения) Экспорт
	
	//
	
КонецПроцедуры

// Можно переопределеить ключ основного меню расширенного глобального поиска.
// 
// Возвращаемое значение:
//  Строка
Функция КлючОсновногоМенюРасширенногоГлобальногоПоиска() Экспорт
	
	Возврат "";
	
КонецФункции

#КонецОбласти