// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Словарь глобального поиска метаданных.
// 
// Параметры:
//  ВыводитьВариантыОтчетов - см. РГП_ГлобальныйПоискСервер.СловарьГлобальногоПоискаМетаданных.ВыводитьВариантыОтчетов
// 
// Возвращаемое значение:
//  см. РГП_ГлобальныйПоискСервер.СловарьГлобальногоПоискаМетаданных
Функция СловарьГлобальногоПоискаМетаданных(ВыводитьВариантыОтчетов) Экспорт
	
	Возврат РГП_ГлобальныйПоискСервер.СловарьГлобальногоПоискаМетаданных(ВыводитьВариантыОтчетов, Ложь);
	
КонецФункции

#КонецОбласти
