// @strict-types
// @skip-check module-empty-method

#Область СлужебныйПрограммныйИнтерфейс

// Срабатывает ПЕРЕД заполнением параметров глобального поиска но уже ПОСЛЕ заполнения серверных данных
// Позволяет наполнить параметры кэшем ролей, прав, метаданных и прочей информацией, которая не доступна с клиента, чтобы уменьшить обращения к серверу
// 
// Параметры:
//  Параметры - см. РГП_ГлобальныйПоискКлиент.ПараметрыРасширенногоГлобальногоПоиска
//  ДополнительныеПараметры - Неопределено - Не используется, необходим для описания оповещения
//
// Пример:
//	Можно заполнять необходимые серверные данные
//	
//	РГП_ГлобальныйПоискКлиентСервер.ДополнитьКэшРолейПользователей(Параметры, "АдминистраторСистемы");
//	РГП_ГлобальныйПоискКлиентСервер.ДополнитьКэшПравПользователей(Параметры, "Администрирование");
//	Параметры.ДополнительныеПараметры.Вставить("МоиДанные");
Процедура ПередЗаполнениемПараметровГлобальногоПоиска(Параметры, ДополнительныеПараметры = Неопределено) Экспорт

КонецПроцедуры

#КонецОбласти
