// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры выполнения команды расширенного глобального поиска.
// 
// Возвращаемое значение:
//  Структура - Параметры выполнения команды расширенного глобального поиска:
// * Ключ - Строка
// * Разделитель - Строка
// * ПолныйКлюч - Строка
// * ДополнительныеПараметры - Структура из КлючИЗначение:
// ** Ключ - Строка
// ** Значение - Произвольный
Функция ПараметрыВыполненияКомандыРасширенногоГлобальногоПоиска() Экспорт
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Ключ", "");
	ПараметрыВыполнения.Вставить("Разделитель", "");
	ПараметрыВыполнения.Вставить("ПолныйКлюч", "");
	ПараметрыВыполнения.Вставить("ДополнительныеПараметры", Новый Структура);
	
	Возврат ПараметрыВыполнения;
	
КонецФункции

#КонецОбласти
