
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = РГПТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("МодульПользователей")
			.ДобавитьТест("Тест_МодульПользователей_Успешно", "Метод вернул общий модуль")
	;

КонецПроцедуры

#Область Тесты

#Область МодульПользователей

Процедура Тест_МодульПользователей_Успешно() Экспорт

	Перем ЮТест;
	ЮТест = РГПТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Результат = ТестируемыйМодуль.МодульПользователей();
	
	ЮТест.ОжидаетЧто(Результат).ИмеетТип("ОбщийМодуль");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль()
	
	Возврат РГПТ_Модули.ГлобальныйПоискСервер();
	
КонецФункции

#КонецОбласти