// @strict-types
// @skip-check module-empty-method

#Область СлужебныйПрограммныйИнтерфейс

// После заполнения параметров расширенного глобального поиска.
// 
// Параметры:
//  ПараметрыПоиска - см. РГП_ГлобальныйПоискКлиент.ПараметрыРасширенногоГлобальногоПоиска
//  ДополнительныеПараметры - Неопределено - Не используется, необходим для описания оповещения
//
// Пример:
// Можно доработать параметры поиска и добавить свои команды
// Отключение использования команды в зависимости от роли:
//
//	КомандаПоиска = РГП_ГлобальныйПоискКлиент.ОписаниеКомандыПоискаПоФормам(ПараметрыПоиска);
//
//	//Ограничение на полноправного пользователя (БСП)
//	КомандаПоиска.Использование = РГП_ГлобальныйПоискКлиентСервер.ЭтоПолноправныйПользователь(ПараметрыПоиска);
//
//	//Ограничение по конкретной роли
//	КомандаПоиска.Использование = РГП_ГлобальныйПоискКлиентСервер.РолиДоступны(ПараметрыПоиска, "АдминистраторСистемы");
//
//	//Ограничение по конкретному праву
//	КомандаПоиска.Использование = РГП_ГлобальныйПоискКлиентСервер.ЕстьПравоДоступа(ПараметрыПоиска, "Администрирование");
Процедура ПослеЗаполненияПараметровГлобальногоПоиска(
	ПараметрыПоиска, ДополнительныеПараметры = Неопределено) Экспорт

КонецПроцедуры

#КонецОбласти