
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ЭлементИзбранного);
	ИзначальнаяСтрокаПоиска = ПолнаяСтрокаПоиска;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда_Сохранить(Команда)
	
	ЭлементИзбранного = РГП_ГлобальныйПоискКлиентСервер.ЭлементИзбранного(ПолнаяСтрокаПоиска, Представление);
	РГП_ГлобальныйПоискКлиент.ИзменитьВИзбранном(ИзначальнаяСтрокаПоиска, ЭлементИзбранного);
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Команда_Удалить(Команда)
	
	РГП_ГлобальныйПоискКлиент.ИзменитьВИзбранном(ИзначальнаяСтрокаПоиска);
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Команда_Закрыть(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
