// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// см. РГП_ГлобальныйПоискКлиент.ПараметрыРасширенногоГлобальногоПоиска
Функция ПараметрыРасширенногоГлобальногоПоиска() Экспорт
	
	Возврат РГП_ГлобальныйПоискКлиент.ПараметрыРасширенногоГлобальногоПоиска(Ложь);
	
КонецФункции

//@skip-check doc-comment-export-function-return-section - Баг ЕДТ
//см. РГП_ГлобальныйПоискВызовСервера.ВерсияРасширения
Функция ВерсияРасширения() Экспорт
	
	//@skip-check unknown-method-property - Баг ЕДТ
	Возврат РГП_ГлобальныйПоискВызовСервера.ВерсияРасширения();
	
КонецФункции

#КонецОбласти
