// @strict-types
// @skip-check module-empty-method

#Область СлужебныйПрограммныйИнтерфейс

// Переопределяемый модуль. 
// Метод позволяет подменить переопределяемый модуль, чтобы вести доработки в отдельном расширении
// 
// Возвращаемое значение:
//  CommonModule.РГП_ГлобальныйПоискСерверПереопределяемый
Функция Модуль() Экспорт
	
	Возврат РГП_ГлобальныйПоискСерверПереопределяемый;
	
КонецФункции

// Перед выполнением глобального поиска метаданных.
// 
// Параметры:
//  ОбщиеПараметры - см. РГП_ГлобальныйПоискСервер.ПараметрыВыполненияГлобальногоПоискаМетаданных
//  ИзначальнаяСтрокаПоиска - Строка
Процедура ПередВыполнениемГлобальногоПоискаМетаданных(ОбщиеПараметры, ИзначальнаяСтрокаПоиска) Экспорт
		
КонецПроцедуры

// Срабатывает ПЕРЕД заполнением параметров расширенного глобального поиска но уже ПОСЛЕ стандартного заполнения серверных данных
// Позволяет наполнить параметры кэшем ролей, прав, метаданных и прочей информацией, которая не доступна с клиента, чтобы уменьшить обращения к серверу
// 
// Параметры:
//  Параметры - см. РГП_ГлобальныйПоискКлиент.ПараметрыРасширенногоГлобальногоПоиска
//
// Пример:
//	Можно заполнять необходимые серверные данные
//	
//	РГП_ГлобальныйПоискКлиентСервер.ДополнитьКэшРолейПользователей(Параметры, "АдминистраторСистемы");
//	РГП_ГлобальныйПоискКлиентСервер.ДополнитьКэшПравПользователей(Параметры, "Администрирование");
//	Параметры.ДополнительныеПараметры.Вставить("МоиДанные");
Процедура ПередЗаполнениемПараметровРасширенногоГлобальногоПоиска(Параметры) Экспорт
		
КонецПроцедуры

#КонецОбласти
