// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Переопределяемый модуль. 
// Метод позволяет подменить переопределяемый модуль, чтобы вести доработки в отдельном расширении
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция Модуль() Экспорт
	
	Возврат РГП_ГлобальныйПоискСерверПереопределяемый;
	
КонецФункции

// Перед выполнением глобального поиска метаданных.
// 
// Параметры:
//  ОбщиеПараметры - см. РГП_ГлобальныйПоискСервер.ПараметрыВыполненияГлобальногоПоискаМетаданных
//  ИзначальнаяСтрокаПоиска - Строка
Процедура ПередВыполнениемГлобальногоПоискаМетаданных(ОбщиеПараметры, ИзначальнаяСтрокаПоиска) Экспорт
	
	//Можно доработать параметры выполнения
	
КонецПроцедуры

// Срабатывает ПЕРЕД заполнением параметров расширенного глобального поиска но уже ПОСЛЕ стандартного заполнения серверных данных
// Позволяет наполнить параметры кэшем ролей, прав, метаданных и прочей информацией, которая не доступна с клиента, чтобы уменьшить обращения к серверу
// 
// Параметры:
//  Параметры - см. РГП_ГлобальныйПоискКлиент.ПараметрыРасширенногоГлобальногоПоиска
Процедура ПередЗаполнениемПараметровРасширенногоГлобальногоПоиска(Параметры) Экспорт
	
	//Можно заполнять необходимые серверные данные
	
КонецПроцедуры

#КонецОбласти