
#Область ПрограммныйИнтерфейс

// РГП_ГлобальныйПоискКлиент
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ГлобальныйПоискКлиент() Экспорт

	Возврат РГПТ_Движок.ОбщийМодуль("РГП_ГлобальныйПоискКлиент");
	
КонецФункции

// РГП_ГлобальныйПоискКлиентСервер
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ГлобальныйПоискКлиентСервер() Экспорт
	
	Возврат РГПТ_Движок.ОбщийМодуль("РГП_ГлобальныйПоискКлиентСервер");
	  
КонецФункции

// РГП_ГлобальныйПоискСервер
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ГлобальныйПоискСервер() Экспорт
	
	Возврат РГПТ_Движок.ОбщийМодуль("РГП_ГлобальныйПоискСервер");
	  
КонецФункции

// РГП_ГлобальныйПоискВызовСервера
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ГлобальныйПоискВызовСервера() Экспорт
	
	Возврат РГПТ_Движок.ОбщийМодуль("РГП_ГлобальныйПоискВызовСервера");
	  
КонецФункции

#КонецОбласти
